import { Azkar } from './azkarTypes';

const azkarEvening: Azkar[] = [
  {
    id: `1-ev`,
    text: `أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ`,
    transliteration: `А'узу би-кялимати Лляхи-т-таммати мин шарри ма халяка.`,
    translation: `Прибегаю к совершенным словам Аллаха от зла того, что Он сотворил.`,
    repetition: 1,
    source: `Муслим`,
    effect: `💎 Тому, кто произнесёт эти слова, остановившись в каком-либо месте, ничто не причинит вреда до тех пор, пока он не покинет его.`
  },
  {
    id: `2-ev`,
    text: `اللَّهُمَّ أَنْتَ رَبِّي
لَا إِلَهَ إِلَّا أَنْتَ
خَلَقْتَنِي وَأَنَا عَبْدُكَ
وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ
أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ
أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ
وَأَبُوءُ بِذَنْبِي
فَاغْفِرْ لِي
فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ`,
    transliteration: `Аллахумма, Анта Рабби,
ля иляха илля Анта,
халякта-ни ва ана 'абду-кя,
ва ана "аля 'ахди-кя ва ва'ди-кя ма-стата'ту.
А'узу би-кя мин шарри ма сана'ту,
абу'у ля-кя би-ни'мати-кя 'аляййя,
ва абу'у би-занби,
фа-гфир ли,
фа-инна-ху ля йагфи-ру-з-зунуба илля Анта!`,
    translation: `О Аллах, Ты — Господь мой,
и нет достойного поклонения, кроме Тебя,
Ты создал меня, а я — Твой раб, 
и я буду хранить верность Тебе, пока у меня хватит сил. 
Прибегаю к Тебе от зла того, что я сделал,
признаю милость, оказанную Тобой мне,
и признаю грех свой. 
Прости же меня, 
ибо, поистине, никто не прощает грехов, кроме Тебя!`,
    repetition: 1,
    source: `аль-Бухари`,
    effect: `💎 Кто произнесёт эти слова днём, будучи убеждённым в них, и умрёт в тот же день до наступления вечера, окажется среди обитателей Рая.`
  },
  {
    id: `3-ev`,
    text: `لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ
لَا شَرِيكَ لَهُ
لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ
وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ`,
    transliteration: `Ля иляха илля-Ллаху вахда-ху
ля шарикя ля-ху,
ля-ху-ль-мульку ва ля-ху-ль-хамду
ва хуа 'аля кулли шайин кадир.
`,
    translation: `Нет достойного поклонения, кроме одного лишь Аллаха,
у которого нет сотоварища,
Ему принадлежит владычество, Ему хвала,
Он всё может.`,
    repetition: 10,
    source: `Муслим`,
    effect: `💎 Кто произнесёт эти слова десять раз, получит награду как за освобождение четырёх рабов.`
  },
  {
    id: `4-ev`,
    text: `سُبْحَانَ اللَّهِ وَبِحَمْدِهِ`,
    transliteration: `Субхана-Ллахи ва би-хамди-хи.`,
    translation: `Слава Аллаху и хвала Ему.`,
    repetition: 100,
    source: `Муслим`,
    effect: `💎 Эти два слова легки для языка, тяжелы на весах в день суда и любимы Аллаху.`
  },
  {
    id: `5-ev`,
    text: `أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ
لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ
لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا
وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا
رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ
رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ
`,
    transliteration: `Амсайна ва амса-ль-мульку ли-Лляхи ва-ль-хамду ли-Лляхи,
ля иляха илля Ллаху вахда-ху ля шарикя ля-ху,
ля-ху-ль-мульку ва ля-ху-ль-хамду ва хуа ааля кулли шайин кадирун.
Рабби ас'алюкя хайра ма фи хазихи-ль-лейляти ва хайра ма ба'адаха
ва а'узу бикя мин шарри ма фи хазихи-ль-лейляти ва шарри ма ба'адаха
Рабби, а'узу би-кя мин аль-кясали ва суи-ль-кибари,
Рабби, а'узу би-кя мин 'азабин фи-н-нари ва 'азабин фи-ль-кабри!
`,
    translation: `Мы дожили до вечера, и этим вечером владычество принадлежит Аллаху и хвала Аллаху,
нет достойного поклонения, кроме одного лишь Аллаха, у которого нет сотоварища.
Ему принадлежит владычество, Ему хвала, Он всё может.
Господь мой, прошу Тебя о благе того, что будет в эту ночь, и благе того, что за ней последует,
и прибегаю к Тебе от зла того, что будет в эту ночь, и зла того, что за ней последует.
Господь мой, прибегаю к Тебе от нерадения и старческой дряхлости,
Господь мой, прибегаю к Тебе от мучений в огне и мучений в могиле!
`,
    repetition: 1,
    source: `Муслим`,
    effect: ``
  },
  {
    id: `6-ev`,
    text: `اللَّهُمَّ بِكَ أَمْسَيْنَا
وَبِكَ نَحْيَا
وَبِكَ نَمُوتُ
وَإِلَيْكَ الْمَصِيرُ
`,
    transliteration: `Аллахума, би-ка амсайна,
ва би-ка нахйа,
ва би-ка намуту
ва иляй-ка-ль-масыру.`,
    translation: `О Аллах, благодаря Тебе мы дожили до вечера.
Ты даёшь нам жизнь,
и Ты лишаешь нас её
и Ты воскресишь нас для отчета.`,
    repetition: 1,
    source: `ат-Тирмизи, Ахмад, Абу Дауд`,
    effect: ``
  },
  {
    id: `7-ev`,
    text: `اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَ الْآخِرَةِ
اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي
اللَّهُمَّ اسْتُرْ عَوْرَاتِي
وَآمِنْ رَوْعَاتِي
اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ
وَمِنْ خَلْفِي
وَعَنْ يَمِينِي
وَعَنْ شِمَالِي
وَمِنْ فَوْقِي
وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي
`,
    transliteration: `Аллахумма, инни ас'алю-кя-ль-'афийата фи-д-дунья ва-ль-ахирати,
Аллахумма, инни ас'алю-кя-ль-'афуа ва-ль-'афийата фи дини, ва ду-ньяйа, ва ахли, ва мали.
Аллахумма-стур 'аурати
ва-амин рау'ати,
Аллахумма-хфаз-ни мин байни йадаййа,
ва мин хальфи,
ва 'ан ямини,
ва 'ан шимали
ва мин фауки,
ва а'узу би-'азамати-кя ан угталя мин тахти!
`,
    translation: `O Аллах, поистине, я прошу Тебя о прощении и благополучии в мире этом и в мире ином,
о Аллах, поистине, я прошу Тебя о прощении и благополучии в моей религии, и моих мирских делах, в моей семье и в моём имуществе.
О Аллах, прикрой мою наготу
и огради меня от страха,
о Аллах, защити меня спереди,
и сзади,
и справа,
и слева,
и сверху,
и я прибегаю к величию Твоему от того, чтобы быть предательски убитым снизу.
`,
    repetition: 1,
    source: `ат-Тирмизи, Ахмад, Абу Дауд`,
    effect: ``
  },
  {
    id: `8-ev`,
    text: `اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ
فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ
رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ
أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ
أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي
وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ
وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا
أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ
`,
    transliteration: `Аллахумма, 'Алима-ль-гайби ва-ш-шахадати,
Фатира-с-самавати ва-ль-арди,
Рабба кулли шайин ва Малика-ху,
ашхаду алля иляха илля Анта,
а'узу би-кя мин шарри нафси,
ва мин шарри-ш-шайтани ва ширки-хи
ва ан актарифа 'аля нафси су'ан
ау аджурра-ху иля мусли-мин.`,
    translation: `O Аллах, Знающий сокрытое и явное,
Творец небес и земли,
Господь и Владыка всего,
свидетельствую, что нет достойного поклонения, кроме Тебя,
прибегаю к Тебе от зла души своей,
от зла и многобожия шайтана и от того, чтобы причинить зло самому себе
или навлечь его на какого-нибудь мусульманина.`,
    repetition: 1,
    source: `ат-Тирмизи, Ахмад`,
    effect: ``
  },
  {
    id: `9-ev`,
    text: `رَضِيتُ بِاللَّهِ رَبًّا
وَبِالْإسْلَامِ دِيناً
وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا
`,
    transliteration: `Радийту би-Лляхи Раббан,
ва би-ль-ислами динан
ва би-Мухаммадин, сал-ля-Ллаху 'аляй-хи ва салляма, набийан
`,
    translation: `Доволен я Аллахом как Господом,
Исламом — как религией
и Мухаммадом, мир ему и благословение Аллаха, — как пророком!
`,
    repetition: 3,
    source: `Абу Дауд, Ахмад`,
    effect: `💎 Обязательно войдёт в Рай тот, кто будет произносить эти слова, будучи убеждённым в них.`
  },
  {
    id: `10-ev`,
    text: `يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ
أَصْلِحْ لِي شَأْنِي كُلَّهُ
وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ
`,
    transliteration: `Йа Хаййу, йа Кайюму, би-рахмати-кя астагису,
аслих ли ша'ни кулля-ху
ва ля такиль-ни иля нафси тарфата 'айнин!
`,
    translation: `О Живой, о Вечносущий, обращаюсь за защитой к милосердию Твоему,
приведи в порядок все мои дела
и не доверяй меня душе моей ни на мгновение!
`,
    repetition: 1,
    source: `ан-Насаи`,
    effect: ``
  },
  {
    id: `11-ev`,
    text: `حَسْبِيَ اللَّهُ
لَا إِلَهَ إِلَّا هُوَ
عَلَيْهِ تَوَكَّلْتُ
وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ
`,
    transliteration: `Хасбия-Ллаху,
ля иляха илля хуа,
'аляй-хи таваккяльту
ва хуа Раббу-ль-'арши-ль-'азыми.
`,
    translation: `Достаточно мне Аллаха,
нет достойного поклонения, кроме Него,
на Него я уповаю
и Он — Господь великого трона.
`,
    repetition: 7,
    source: `Абу Дауд`,
    effect: `💎 Аллах избавит от забот того, кто станет произносить эти слова, будучи убеждённым в них.`
  },
  {
    id: `12-ev`,
    text: `بِسْمِ اللَّهِ الَّذِي
لَا يَضُرُّ مَعَ اسْمِهِ
شَيْءٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ
وَهُوَ السَّمِيعُ الْعَلِيمُ
`,
    transliteration: `Би-сми-Лляхи аллязи
ля йадурру ма'а исми-хи
шайун фи-ль-арди ва ля фи-с-самаи
ва хуа-с-Сами'у-ль-'Алиму
`,
    translation: `С именем Аллаха,
с именем которого ничто не причинит вред
ни на земле, ни на небе,
ведь Он — Слышащий, Знающий!
`,
    repetition: 3,
    source: `ат-Тирмизи, Ахмад`,
    effect: `💎 Того, кто произнёс это утром или вечером, не постигнет какой-либо вред.`
  },
  {
    id: `13-ev`,
    text: `
بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
قُلْ هُوَ ٱللَّهُ أَحَدٌ
ٱللَّهُ ٱلصَّمَدُ
لَمْ يَلِدْ وَلَمْ يُولَدْ
وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ`,
    transliteration: ``,
    translation: `С именем Аллаха, Милостивого, Милосердного!
Скажи: «Он — Аллах Единый,
Аллах самодостаточен.
Он не родил и не был рождён,
и нет никого, равного Ему».
`,
    repetition: 3,
    source: `Коран`,
    effect: ``
  },
  {
    id: `14-ev`,
    text: `
بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ
مِن شَرِّ مَا خَلَقَ
وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ
وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ
وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ
`,
    transliteration: ``,
    translation: `С именем Аллаха, Милостивого, Милосердного!
Скажи: «Прибегаю к защите Господа рассвета
от зла того, что Он сотворил,
от зла мрака, когда он наступает,
от зла колдуний, поплевывающих на узлы,
от зла завистника, когда он завидует».`,
    repetition: 3,
    source: `Коран`,
    effect: ``
  },
  {
    id: `15-ev`,
    text: `بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ
مَلِكِ ٱلنَّاسِ
إِلَـٰهِ ٱلنَّاسِ
مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ
ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ
مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ
`,
    transliteration: ``,
    translation: `С именем Аллаха, Милостивого, Милосердного!
Скажи: «Прибегаю к защите Господа людей,
Царя людей,
Бога людей,
от зла искусителя отступающего при поминании Аллаха,
который наущает в груди людей
и бывает из джиннов и людей».
`,
    repetition: 3,
    source: `Коран`,
    effect: ``
  },
  {
    id: `16-ev`,
    text: `ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ 
لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ 
لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ 
مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ 
يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ 
وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ 
وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ 
وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ 
وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ
`,
    transliteration: ``,
    translation: `Аллах — нет божества, кроме Него, Живого, Вседержителя.
Им не овладевают ни дремота, ни сон.
Ему принадлежит то, что на небесах, и то, что на земле.
Кто станет заступаться перед Ним без Его дозволения?
Он знает их будущее и прошлое.
Они постигают из Его знания только то, что Он пожелает.
Его Престол (Подножие Трона) объемлет небеса и землю,
и не тяготит Его оберегание их.
Он — Возвышенный, Великий.
`,
    repetition: 1,
    source: `Коран`,
    effect: ``
  },
]

export default azkarEvening;